Catalogs/CRM_ПотенциальныеКонтрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>CRM_ПотенциальныеКонтрагенты</Name>
			<Comment>Потенциальные клиенты</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Comment>Вид контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Comment>Форма собственности контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Ссылка на организацию для собственных филиалов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>Код ОКПО контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Comment>Код ИМНС контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Дополнительная информация о контрагенте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Если флажок установлен, то при заполнении приходных документов от этого контрагента, товары будут поступать без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения контактного лица</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Пол контактного лица</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись о контрагенте</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанных</Name>
					<Comment>Согласие на обработку персональных данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтветов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанныхДата</Name>
					<Comment>Дата согласия на обработку персональных данных</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Имя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Comment>Отчество</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодBCS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласенНаКоммуникацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СемейноеПоложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоМестуРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>Банковский счет контрагента, используемый по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтношений</Name>
					<Comment>Вид отношений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимоотношений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТелефон</Name>
					<Comment>Основной телефон контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Renault_ВедушийКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставСемьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родственник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Comment>Виды подтверждающих документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свидетельство</Name>
					<Comment>Свидетельство</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаИзЭлектронногоПаспорта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Общегражданский паспорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удостоверение</Name>
					<Comment>Удостоверение личности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйБилет</Name>
					<Comment>Военный билет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
					<Comment>Справка (например об освобождении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий документ удостоверяющий личность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПТС</Name>
					<Comment>Паспорт транспортного средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АттестатТО</Name>
					<Comment>Аттестат аккредитации оператора технического осмотра транспортных средств</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/CRM_ПотенциальныеКонтрагенты/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПрочитатьДанные()
	Иначе
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
		Если Параметры.Свойство("ЭлектронныйАдрес") Тогда
			ЭлектронныйАдрес = Параметры.ЭлектронныйАдрес;
		КонецЕсли;
		Если Параметры.Свойство("Телефон") Тогда
			МобильныйТелефон = Параметры.Телефон;
		КонецЕсли;
		Если Параметры.Свойство("Город") Тогда
			Город = Параметры.Город;
		КонецЕсли;
		Если Параметры.Свойство("Адрес") Тогда
			Адрес = Параметры.Адрес;
		КонецЕсли;
		Если Параметры.Свойство("ПаспортСерия") Тогда
			ПаспортСерия = Параметры.ПаспортСерия;
		КонецЕсли;
		Если Параметры.Свойство("ПаспортНомер") Тогда
			ПаспортНомер = Параметры.ПаспортНомер;
		КонецЕсли;
		Если Параметры.Свойство("ВУСерия") Тогда
			ВУСерия = Параметры.ВУСерия;
		КонецЕсли;
		Если Параметры.Свойство("ВУНомер") Тогда
			ВУНомер = Параметры.ВУНомер;
		КонецЕсли;
	КонецЕсли;
		
	СогласиеНаОПД();	
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПечатиОПД();
КонецПроцедуры

Функция СогласиеНаОПД() ДокументСогласиеНаОбработкуПерсональныхДанных=Документы.DMS_СогласиеНаОбработкуПерсональныхДанных.СогласиеНаОбработку(Объект.Ссылка); Возврат ДокументСогласиеНаОбработкуПерсональныхДанных КонецФункции	

&НаСервере
Процедура ПрочитатьДанные()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Поле4,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Ссылка
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МобильныйТелефон = Выборка.Представление;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДомашнийТелефон = Выборка.Представление;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭлектронныйАдрес = Выборка.Представление;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Город = Выборка.Поле4;
		Адрес = Выборка.Представление;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Ссылка
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Паспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПаспортСерия = Выборка.Серия;
		ПаспортНомер = Выборка.Номер;
		ПаспортДатаВыдачи = Выборка.ДатаВыдачи;
		ПаспортКемВыдан = Выборка.КемВыдан;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Удостоверение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВУСерия = Выборка.Серия;
		ВУНомер = Выборка.Номер;
		ВУДатаВыдачи = Выборка.ДатаВыдачи;
		ВУКемВыдано = Выборка.КемВыдан;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьДанные();
	Если ТекущийОбъект.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да И СогласиеНаОПД().Пустая() Тогда
		//Отказ=Истина;
		Сообщить("Не оформлен документ согласия на обработку персональных данных. Ввести на основании");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанные()
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
	Если ЗначениеЗаполнено(МобильныйТелефон) Тогда
		Менеджер.Представление = МобильныйТелефон;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
	Если ЗначениеЗаполнено(ДомашнийТелефон) Тогда
		Менеджер.Представление = ДомашнийТелефон;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
	Если ЗначениеЗаполнено(ЭлектронныйАдрес) Тогда
		Менеджер.Представление = ЭлектронныйАдрес;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Объект.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
	Если ЗначениеЗаполнено(Адрес) ИЛИ ЗначениеЗаполнено(Город) Тогда
		Менеджер.Представление = ?(ЗначениеЗаполнено(Адрес), Адрес, Город);
		Менеджер.Поле4 = Город;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Ссылка
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Ссылка
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Паспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Об = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Об = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	КонецЕсли;
	Если ЗначениеЗаполнено(ПаспортСерия) 
			ИЛИ ЗначениеЗаполнено(ПаспортНомер) 
			ИЛИ ЗначениеЗаполнено(ПаспортДатаВыдачи) 
			ИЛИ ЗначениеЗаполнено(ПаспортКемВыдан) Тогда
		Об.Наименование = "Паспорт";
		Об.Владелец = Объект.Ссылка;
		Об.Серия = ПаспортСерия;
		Об.Номер = ПаспортНомер;
		Об.ДатаВыдачи = ПаспортДатаВыдачи;
		Об.КемВыдан = ПаспортКемВыдан;
		Об.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
		Об.Записать();
	ИначеЕсли НЕ Об.ЭтоНовый() Тогда
		Об.Удалить();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Удостоверение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Об = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Об = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	КонецЕсли;
	Если ЗначениеЗаполнено(ВУСерия) 
			ИЛИ ЗначениеЗаполнено(ВУНомер) 
			ИЛИ ЗначениеЗаполнено(ВУДатаВыдачи) 
			ИЛИ ЗначениеЗаполнено(ВУКемВыдано) Тогда
		Об.Наименование = "Водительское удостоверение";
		Об.Владелец = Объект.Ссылка;
		Об.Серия = ВУСерия;
		Об.Номер = ВУНомер;
		Об.ДатаВыдачи = ВУДатаВыдачи;
		Об.КемВыдан = ВУКемВыдано;
		Об.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Удостоверение;
		Об.Записать();
	ИначеЕсли НЕ Об.ЭтоНовый() Тогда
		Об.Удалить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	СформироватьФИОНаКлиенте();	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	СформироватьФИОНаКлиенте();	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	СформироватьФИОНаКлиенте();	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФИОНаКлиенте()  
	
	Объект.Наименование = СокрЛП(Объект.Фамилия) + ?(ПустаяСтрока(СокрЛП(Объект.Имя)),""," " + СокрЛП(Объект.Имя)) + ?(ПустаяСтрока(СокрЛП(Объект.Отчество)),""," " + СокрЛП(Объект.Отчество));
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = СокрЛП(Объект.Наименование);
	КонецЕсли; 
	
КонецПроцедуры // СформироватьФИОНаКлиенте()

&НаСервере
Процедура ПечатьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)

	Если ЭтаФорма.Модифицированность Тогда 
		Сообщить("Перед печатью документа, необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Если Объект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда 
		СтруктураПараметров = СофрмироватьПараметрыДляПФ("ПерсональныеДанные",Истина);
		МассивФайлов = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметров,Объект.Ссылка);
		Если МассивФайлов = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму обработки персональных данных");
			Возврат;
		КонецЕсли;
		
		Для каждого Файл Из МассивФайлов Цикл
			НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.СогласенНаКоммуникацию Тогда 
		СтруктураПараметров = СофрмироватьПараметрыДляПФ("Коммуникация",Истина);
		МассивФайлов = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметров,Объект.Ссылка);
		Если МассивФайлов = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось получить печатную форму обработки персональных данных");
			Возврат;
		КонецЕсли;
		
		Для каждого Файл Из МассивФайлов Цикл
			НачатьПолучениеФайлаССервера(ПоместитьВоВременноеХранилище(Base64Значение(Файл["ДанныеФайла"])), Файл["ИмяФайла"], Новый ПараметрыДиалогаПолученияФайлов());
		КонецЦикла;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Функция СофрмироватьПараметрыДляПФ(ВидСогласия,Согласие)
	
	СтруктураОбъекта = Новый Структура;
	СтруктураКлиента = Новый Структура;
	СтруктураДокумента = Новый Структура;
	СтруктураАвтомобиля = Новый Структура;
	СтруктураСогласия = Новый Структура;
	СтруктураОтвветсвенный = Новый Структура;
	
	СтруктураДокумента.Вставить("passportnumber",ПаспортНомер);
	СтруктураДокумента.Вставить("passportseries",ПаспортСерия);
	СтруктураДокумента.Вставить("passportissued",ПаспортКемВыдан); 
	СтруктураДокумента.Вставить("passportday",Формат(ПаспортДатаВыдачи,"ДФ=dd"));
	СтруктураДокумента.Вставить("passportmonth",Формат(ПаспортДатаВыдачи,"ДФ=MM"));
	СтруктураДокумента.Вставить("passportyear",Формат(ПаспортДатаВыдачи,"ДФ=yyyy"));

	СтруктураКлиента.Вставить("lastname",Объект.Фамилия);
	СтруктураКлиента.Вставить("firstname",Объект.Имя);
	СтруктураКлиента.Вставить("middlename",Объект.Отчество);
	СтруктураКлиента.Вставить("birthday",Объект.ДатаРождения);
	СтруктураКлиента.Вставить("gender",?(Объект.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",""+Объект.Пол));
	СтруктураКлиента.Вставить("address",Адрес);
	СтруктураКлиента.Вставить("tel",МобильныйТелефон);
	СтруктураКлиента.Вставить("email",ЭлектронныйАдрес);
	СтруктураКлиента.Вставить("company",?(Объект.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо,Истина,Ложь));
	СтруктураКлиента.Вставить("document",СтруктураДокумента);
	СтруктураОбъекта.Вставить("client",СтруктураКлиента);
	
	СтруктураАвтомобиля.Вставить("mark","");
	СтруктураАвтомобиля.Вставить("vin","");
	СтруктураАвтомобиля.Вставить("daybuycar",Дата("00010101"));
	СтруктураОбъекта.Вставить("auto",СтруктураАвтомобиля);
	
	СтруктураСогласия.Вставить("form",ВидСогласия);
	СтруктураСогласия.Вставить("agree",Согласие);
	СтруктураОбъекта.Вставить("consent",СтруктураСогласия);
	
	СтруктураОтвветсвенный.Вставить("name",""+ПараметрыСеанса.Пользователь.Сотрудник);
	СтруктураОтвветсвенный.Вставить("from","Форма потенциального контрагента");
	СтруктураОбъекта.Вставить("responsible",СтруктураОтвветсвенный);
	
	Возврат СтруктураОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьВФайл(Файл)
	
	выборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	выборФайла.ПолноеИмяФайла = Файл["ИмяФайла"];
	Если выборФайла.Выбрать() Тогда
		//ИмяФайла = Файл["ИмяФайла"];
		ДанныеФайла = Base64Значение(Файл["ДанныеФайла"]);	
		ДанныеФайла.записать(выборФайла.ПолноеИмяФайла);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СогласиеНаОбработкуПерсональныхДанныхПриИзменении(Элемент)
	УстановитьДоступностьПечатиОПД();
	Если Объект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Вопрос("Согласие на обработку персональных данных будет отозвано. Продолжить?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		СтруктураПараметров = СофрмироватьПараметрыДляПФ("ПерсональныеДанные",Ложь);
		ОтветСервера = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметров,Объект.Ссылка);
		
		Если ОтветСервера = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось отозвать согласие.");
			Объект.СогласиеНаОбработкуПерсональныхДанных = СогласиеСохранение;
		Иначе 	
			ПоказатьПредупреждение(,ОтветСервера["answer"]);
		КонецЕсли;
	Иначе 
		Объект.СогласиеНаОбработкуПерсональныхДанных = СогласиеСохранение;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СогласенНаКоммуникациюПриИзменении(Элемент)
	УстановитьДоступностьПечатиОПД();
	
	Если Объект.СогласенНаКоммуникацию Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Вопрос("Согласие на коммуникацию будет отозвано. Продолжить?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		СтруктураПараметров = СофрмироватьПараметрыДляПФ("Коммуникация",Ложь);
		ОтветСервера = DMS_ОбщегоНазначенияСервер.ПолучитьДанныеОПД(СтруктураПараметров,Объект.Ссылка);
		Если ОтветСервера = Неопределено Тогда 
			ПоказатьПредупреждение(,"Не удалось отозвать согласие.");
			Объект.СогласенНаКоммуникацию = Истина;
		Иначе 	
			ПоказатьПредупреждение(,ОтветСервера["answer"]);
		КонецЕсли;
		
	Иначе 
		Объект.СогласенНаКоммуникацию = Истина;
	КонецЕсли;
	

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПечатиОПД()
	
	Если Объект.СогласиеНаОбработкуПерсональныхДанных <> Перечисления.ВариантыОтветов.Да И Не Объект.СогласенНаКоммуникацию Тогда 
		Элементы.Печать.Доступность = Ложь;
	Иначе 
		Элементы.Печать.Доступность = Истина;
	КонецЕсли;

	
КонецПроцедуры


&НаКлиенте
Процедура СогласиеНаОбработкуПерсональныхДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СогласиеСохранение = Объект.СогласиеНаОбработкуПерсональныхДанных;
КонецПроцедуры
